/*
N№24(N№5) Створити клас Triangle для представлення трикутника. Поля даних повинні
містити кути й сторони. Потрібно реалізувати операції: отримання й зміни
полів даних, обчислення площі, обчислення периметра, обчислення висот, а
також визначення виду трикутника (рівносторонній, рівнобедрений або
прямокутний).

1. Проаналізувати свій варіант завдання.
2. Визначити 3-4 операції для первантаження.
3. Використовуючи проект, розроблений в лабораторній роботі №3,
реалізувати перевантаження операцій, визначених в п.2.
*/

#include <iostream>
#include "newTriangleA.h"

int main()
{
    newTriangleA A(60, 60, 60, 5, 5, 5);
    newTriangleA B(60, 90, 30, 8, 5, 4);
    newTriangleA C = A + B;
    newTriangleA D = A * B;
    newTriangleA E = A ^ B;
}