/*
N№24(N№5) Створити клас Triangle для представлення трикутника. Поля даних повинні
містити кути й сторони. Потрібно реалізувати операції: отримання й зміни
полів даних, обчислення площі, обчислення периметра, обчислення висот, а
також визначення виду трикутника (рівносторонній, рівнобедрений або
прямокутний).

У всіх завданях, мовою С++, в класі реалізувати не менше 3
конструкторів. Для релізації конструкторів використовуємо проект, створений
в лабораторній роботі №2
*/

#include <iostream>
#include "newTriangle.h"
using namespace std;

int main()
{
    newTriangle A;
    newTriangle B(60, 60, 60, 5, 5, 5);
}